<img src=https://i.ibb.co/6gCsHd6/1200px-Pandas-logo-svg.png width="700" height="200">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">Data Analysis with Python</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:150%; text-align:center; border-radius:10px 10px;"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#4d77cf; font-size:200%; text-align:center; border-radius:10px 10px;">Pandas DataFrames</p>

<a id="toc"></a>

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Content</p>

* [IMPORTING LIBRARIES NEEDED IN THIS NOTEBOOK](#0)
* [DATA FRAMES](#1)
* [CREATING A DATA FRAME](#2)
    * [Creating a DataFrame Using the Lists of Data & Columns](#2.1)
    * [Creating a DataFrame Using a Numpy Arrays](#2.2)
    * [Creating a DataFrame Using a Dictionary](#2.3)
    * [The Examination of Some Attributes on Data](#2.4)
* [INDEXING, SLICING & SELECTION](#3)    
* [CREATING A NEW COLUMN](#4)    
* [REMOVING COLUMNS](#5)
* [REMOVING ROWS](#6)
* [SELECTING ROWS & COLUMNS USING .loc[ ] & .iloc[ ] ](#7)
* [CONDITIONAL SELECTION](#8)
    * [One Conditional Statement](#8.1)
    * [Two or More Conditional Statements](#8.2)
    * [Conditional Selection Using .loc[ ]](#8.3)
* [reset_index() & set_index()](#9)
* [Multi-Index & Index Hierarchy](#10)
* [Some Other Useful Methods with Iris Dataset](#11)
* [THE END OF THE SESSION-04](#12)

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Importing Libraries Needed in This Notebook</p>

<a id="0"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Once you've installed NumPy & Pandas you can import them as a library:

In [1]:
import pandas as pd
import numpy as np

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Data Frames</p>

<a id="1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

A DataFrame is a two-dimensional data container, similar to a Matrix, but which can contain heterogeneous data, and for which symbolic names may be associated with the rows and columns. ``DataFrames`` are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. 

### Why use Pandas?

Data scientists make use of Pandas in Python for its **following advantages**:

- Easily handles missing data
- It uses Series for one-dimensional data structure and DataFrame for multi-dimensional data structure
- It provides an efficient way to slice the data
- It provides a flexible way to merge, concatenate or reshape the data
- It includes a powerful time series tool to work with

In a nutshell, Pandas is a useful library in data analysis. It can be used to perform data manipulation and analysis. Pandas provide powerful and easy-to-use data structures, as well as the means to quickly perform operations on these structures.

[SOURCE01](https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html), 
[SOURCE02](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html), 
[SOURCE03](https://morioh.com/p/2528ac775b1b), 
[SOURCE04](https://www.datacamp.com/community/tutorials/pandas-tutorial-dataframe-python), 
[SOURCE05](https://www.guru99.com/python-pandas-tutorial.html), 
[SOURCE06](https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm), 
[SOURCE07](https://realpython.com/pandas-dataframe/) &
[SOURCE08](https://towardsdatascience.com/a-simple-guide-to-pandas-dataframes-b125f64e1453)<br>
[VIDEO SOURCE01](https://www.youtube.com/watch?v=zmdjNSmRXF4), 
[VIDEO SOURCE02](https://www.youtube.com/watch?v=F6kmIpWWEdU) &
[VIDEO SOURCE03](https://towardsdatascience.com/pandas-dataframe-basics-3c16eb35c4f3)<br>

**Now let's use pandas to explore this topic!**

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Creating a DataFrame</p>

<a id="2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

A **``DataFrame``** is a **two-dimension collection of data**. It is a data structure where data is stored in **tabular form**. Datasets are arranged in rows and columns; we can store multiple datasets in the data frame. We can perform various arithmetic operations, such as adding column/row selection and columns/rows in the data frame.

We can import the DataFrames from the external storage; these storages can be referred to as the SQL Database, CSV file, and an Excel file. We can also use the lists, dictionary, and from a list of dictionary, etc.

In this session, we will learn to create the DataFrame in multiple ways. Let's understand these different ways.

**``pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)``**

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using the Lists of Data & Columns</p>

<a id="2.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [2]:
df = pd.read_csv("IMDB_top_1000_LV.csv")
df

,Movie_ID,Title,Certificate,Duration,Genre,Rate,Metascore,Description,Year,Directors,Stars,Votes,Gross($M)
0,1,The Shawshank Redemption,13+,142,Drama,9.3,80,Two imprisoned men bond over a number of years...,1994,Frank Darabont,"Tim Robbins, Morgan Freeman, Bob Gunton, Willi...",2377444,28.34
1,2,The Godfather,16,175,"Crime, Drama",9.2,100,An organized crime dynasty's aging patriarch t...,1972,Francis Ford Coppola,"Marlon Brando, Al Pacino, James Caan, Diane Ke...",1646788,134.97
2,3,The Dark Knight,16,152,"Action, Crime, Drama",9.0,84,When the menace known as the Joker wreaks havo...,2008,Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart, M...",2341216,534.86
3,4,The Godfather: Part II,12,202,"Crime, Drama",9.0,90,The early life and career of Vito Corleone in ...,1974,Francis Ford Coppola,"Al Pacino, Robert De Niro, Robert Duvall, Dian...",1146645,57.30
4,5,12 Angry Men,14,96,"Crime, Drama",9.0,96,A jury holdout attempts to prevent a miscarria...,1957,Sidney Lumet,"Henry Fonda, Lee J. Cobb, Martin Balsam, John ...",701877,4.36
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Breakfast at Tiffany's,AL,115,"Comedy, Drama, Romance",7.6,76,A young New York socialite becomes interested ...,1961,Blake Edwards,"Audrey Hepburn, George Peppard, Patricia Neal,...",168708,0.00
996,997,Giant,G,201,"Drama, Western",7.6,84,Sprawling epic covering the life of a Texas ca...,1956,George Stevens,"Elizabeth Taylor, Rock Hudson, James Dean, Car...",34593,0.00
997,998,From Here to Eternity,12,118,"Drama, Romance, War",7.6,85,"In Hawaii in 1941, a private is cruelly punish...",1953,Fred Zinnemann,"Burt Lancaster, Montgomery Clift, Deborah Kerr...",43867,30.50
998,999,Lifeboat,None,97,"Drama, War",7.6,78,Several survivors of a torpedoed merchant ship...,1944,Alfred Hitchcock,"Tallulah Bankhead, John Hodiak, Walter Slezak,...",26791,0.00
999,1000,The 39 Steps,14,86,"Crime, Mystery, Thriller",7.6,93,A man in London tries to help a counter-espion...,1935,Alfred Hitchcock,"Robert Donat, Madeleine Carroll, Lucie Mannhei...",52686,0.00

In [3]:
my_list = [['John', 25, 'Male'],
           ['Alice', 30, 'Female'],
           ['Bob', 35, 'Male']]

In [4]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [6]:
pd.DataFrame(my_list)

       0   1       2
0   John  25    Male
1  Alice  30  Female
2    Bob  35    Male

In [7]:
list(enumerate(my_list))

[(0, ['John', 25, 'Male']),
 (1, ['Alice', 30, 'Female']),
 (2, ['Bob', 35, 'Male'])]

In [8]:
for i, col in enumerate(my_list):
    df[i] = col
    
df

      0       1     2
0  John   Alice   Bob
1    25      30    35
2  Male  Female  Male

In [11]:
df.columns = ["Name", "Age", "Gender"]

In [14]:
df

   Name     Age Gender
0  John   Alice    Bob
1    25      30     35
2  Male  Female   Male

In [15]:
my_list = [['John', 25, 'Male'],
           ['Alice', 30, 'Female'],
           ['Bob', 35, 'Male']]

labels = ['Name', 'Age', 'Gender']

In [18]:
df = pd.DataFrame.from_records(my_list, columns = labels)
df

    Name  Age  Gender
0   John   25    Male
1  Alice   30  Female
2    Bob   35    Male

In [24]:
df = pd.DataFrame(my_list, columns = labels)
df

    Name  Age  Gender
0   John   25    Male
1  Alice   30  Female
2    Bob   35    Male

In [25]:
my_data = [1, 3, 4, 7, 9, 18]
my_data

[1, 3, 4, 7, 9, 18]

In [26]:
pd.DataFrame(data=my_data, columns = ['column'])

   column
0       1
1       3
2       4
3       7
4       9
5      18

In [27]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}

df1 = pd.DataFrame(data)
df1

   A  B
0  1  4
1  2  5
2  3  6

In [28]:
df2 = df1

In [29]:
df2.drop("A", axis = 1, inplace =True)
df2

   B
0  4
1  5
2  6

In [30]:
df1

   B
0  4
1  5
2  6

In [36]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df1 = pd.DataFrame(data)
df1

   A  B
0  1  4
1  2  5
2  3  6

In [37]:
df2 = pd.DataFrame(df1, copy= True)
df2

   A  B
0  1  4
1  2  5
2  3  6

In [38]:
df1 is df2

False

In [33]:
df2.drop("A", axis = 1, inplace =True)
df2

   B
0  4
1  5
2  6

In [34]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [29]:
df2 is df1

False

In [39]:
df2 = df1.copy()
df2

   A  B
0  1  4
1  2  5
2  3  6

In [31]:
pd.Series(data=my_data, name="column")

0     1
1     3
2     4
3     7
4     9
5    18
Name: column, dtype: int64

In [33]:
pd.DataFrame(my_data, columns=["column"])

   column
0       1
1       3
2       4
3       7
4       9
5      18

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using a Numpy Arrays</p>

<a id="2.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [40]:
my_arr = np.arange(1, 24, 2).reshape(3, 4)
my_arr

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [41]:
df = pd.DataFrame(data=my_arr, columns = ["var1", "var2", "var3", "var4"])
df

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using a Dictionary</p>

<a id="2.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [42]:
s1 = np.random.randint(2, 10, size = 4)
s2 = np.random.randint(3, 10, size = 4)
s3 = np.random.randint(4, 15, size = 4)

In [40]:
s1

array([8, 3, 5, 8])

In [41]:
s2

array([5, 4, 7, 6])

In [42]:
s3

array([9, 8, 6, 5])

In [43]:
myDict = {"var1": s1, "var2" : s2, "var3" : s3}

In [44]:
df = pd.DataFrame(myDict)
df

   var1  var2  var3
0     5     8     7
1     6     9     6
2     9     3    14
3     6     7     7

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">The Examination of Some Attributes on Data</p>

<a id="2.4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [45]:
df

   var1  var2  var3
0     5     8     7
1     6     9     6
2     9     3    14
3     6     7     7

In [46]:
df.head(2)

   var1  var2  var3
0     5     8     7
1     6     9     6

In [47]:
df.tail(2)

   var1  var2  var3
2     9     3    14
3     6     7     7

In [48]:
df.sample(2)

   var1  var2  var3
3     6     7     7
1     6     9     6

In [49]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [50]:
type(df.columns)

pandas.core.indexes.base.Index

In [51]:
for i in df.columns:
    print(i)

var1
var2
var3

In [52]:
myDict

{'var1': array([5, 6, 9, 6]),
 'var2': array([8, 9, 3, 7]),
 'var3': array([ 7,  6, 14,  7])}

In [54]:
myDict["var1"]

array([5, 6, 9, 6])

In [55]:
df["var1"]

0    5
1    6
2    9
3    6
Name: var1, dtype: int32

In [56]:
type(df["var1"])

pandas.core.series.Series

In [57]:
for i in df.columns:
    print(df[i].mean())

6.5
6.75
8.5

In [61]:
df.describe().T

      count  mean       std  min   25%  50%   75%   max
var1    4.0  6.50  1.732051  5.0  5.75  6.0  6.75   9.0
var2    4.0  6.75  2.629956  3.0  6.00  7.5  8.25   9.0
var3    4.0  8.50  3.696846  6.0  6.75  7.0  8.75  14.0

In [62]:
for i in df.columns:
    print(df[i].min())

5
3
6

In [63]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [64]:
[i for i in df.index]

[0, 1, 2, 3]

In [65]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [66]:
[i for i in df.columns]

['var1', 'var2', 'var3']

In [67]:
df.columns = "new1", "new2", "new3"

In [68]:
df

   new1  new2  new3
0     5     8     7
1     6     9     6
2     9     3    14
3     6     7     7

In [69]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [70]:
df.index = ["a", "b", "c", "d"]
df

   new1  new2  new3
a     5     8     7
b     6     9     6
c     9     3    14
d     6     7     7

In [71]:
df.rename(columns = {"new1" : "yeni1", "new2" : "yeni2"})

   yeni1  yeni2  new3
a      5      8     7
b      6      9     6
c      9      3    14
d      6      7     7

In [72]:
df.rename(index = {"a" : 1, 
                  "b" : 2})

   new1  new2  new3
1     5     8     7
2     6     9     6
c     9     3    14
d     6     7     7

In [73]:
df.shape

(4, 3)

In [73]:
df.shape[0]

4

In [74]:
type(df.shape[0])

int

In [75]:
df.shape[1]

3

In [76]:
df.ndim

2

In [77]:
len(df)

4

In [78]:
df.size

12

In [77]:
type(df['new1'])

pandas.core.series.Series

In [74]:
df.values

array([[ 5,  8,  7],
       [ 6,  9,  6],
       [ 9,  3, 14],
       [ 6,  7,  7]])

In [78]:
b = pd.DataFrame([1,2,3])
b.values

array([[1],
       [2],
       [3]], dtype=int64)

In [84]:
df

   new1  new2  new3
a     8     5     9
b     3     4     8
c     5     7     6
d     8     6     5

In [80]:
type(df)

pandas.core.frame.DataFrame

In [81]:
type(df["new1"])

pandas.core.series.Series

In [79]:
"new2" in df

True

In [80]:
"new5" in df

False

In [81]:
"a" in df

False

In [86]:
"a" in df.new1

True

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Indexing, Slicing & Selection</p>

<a id="3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Let's learn a variety of methods to grab data from a DataFrame

In [83]:
from numpy.random import randn

In [89]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [84]:
# creating a DataFrame by "keyword arguments"

np.random.seed(101)
df = pd.DataFrame(randn(5, 4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [85]:
df["Y"]

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [92]:
df.Y

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [86]:
df[["Y"]]

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

In [96]:
df[["Y", "Z"]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [87]:
df["X" : "Z"]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [88]:
df["K" : "P"]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [89]:
df["A":"Z"]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [90]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [91]:
df[["X", "Z"]]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057
E  1.978757  0.683509

In [103]:
# df["A"]

In [92]:
myDict

{'var1': array([5, 6, 9, 6]),
 'var2': array([8, 9, 3, 7]),
 'var3': array([ 7,  6, 14,  7])}

In [107]:
# myDict["var5"]

In [93]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [96]:
df["A" : "C"]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [97]:
df["A" : "C"][["X", "Z"]]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Creating a New Column</p>

<a id="4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [99]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [100]:
df["X"] * df["Y"]

A    0.570325
B    0.270806
C    0.391387
D    0.708208
E    5.156577
dtype: float64

In [101]:
df["Esra"] = df["X"] * df["Y"]

In [102]:
df

          W         X         Y         Z      Esra
A  2.706850  0.628133  0.907969  0.503826  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

In [103]:
df["Sabahattin"] = np.arange(5) 
df

          W         X         Y         Z      Esra  Sabahattin
A  2.706850  0.628133  0.907969  0.503826  0.570325           0
B  0.651118 -0.319318 -0.848077  0.605965  0.270806           1
C -2.018168  0.740122  0.528813 -0.589001  0.391387           2
D  0.188695 -0.758872 -0.933237  0.955057  0.708208           3
E  0.190794  1.978757  2.605967  0.683509  5.156577           4

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Removing Columns</p>

<a id="5"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [104]:
df.drop("Sabahattin", axis = 1)

          W         X         Y         Z      Esra
A  2.706850  0.628133  0.907969  0.503826  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

In [105]:
df

          W         X         Y         Z      Esra  Sabahattin
A  2.706850  0.628133  0.907969  0.503826  0.570325           0
B  0.651118 -0.319318 -0.848077  0.605965  0.270806           1
C -2.018168  0.740122  0.528813 -0.589001  0.391387           2
D  0.188695 -0.758872 -0.933237  0.955057  0.708208           3
E  0.190794  1.978757  2.605967  0.683509  5.156577           4

In [106]:
df.drop(["Sabahattin", "Esra"], axis = 1, inplace=True)

# df = df.drop(["Sabahattin", "Esra"], axis = 1)

In [107]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [120]:
help(df.drop)

Help on method drop in module pandas.core.frame:

drop(labels: 'IndexLabel' = None, *, axis: 'Axis' = 0, index: 'IndexLabel' = None, columns: 'IndexLabel' = None, level: 'Level' = None, inplace: 'bool' = False, errors: 'IgnoreRaise' = 'raise') -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Drop specified labels from rows or columns.

    Remove rows or columns by specifying label names and corresponding
    axis, or by specifying directly index or column names. When using a
    multi-index, labels on different levels can be removed by specifying
    the level. See the `user guide <advanced.shown_levels>`
    for more information about the now unused levels.

    Parameters
    ----------
    labels : single label or list-like
        Index or column labels to drop. A tuple will be used as a single
        label and not treated as a list-like.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Whether to drop labels from the index (0 or 'index') or
        columns (1 or 'columns').
    index : single label or list-like
        Alternative to specifying axis (``labels, axis=0``
        is equivalent to ``index=labels``).
    columns : single label or list-like
        Alternative to specifying axis (``labels, axis=1``
        is equivalent to ``columns=labels``).
    level : int or level name, optional
        For MultiIndex, level from which the labels will be removed.
    inplace : bool, default False
        If False, return a copy. Otherwise, do operation
        inplace and return None.
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and only existing labels are
        dropped.

    Returns
    -------
    DataFrame or None
        DataFrame without the removed index or column labels or
        None if ``inplace=True``.

    Raises
    ------
    KeyError
        If any of the labels is not found in the selected axis.

    See Also
    --------
    DataFrame.loc : Label-location based indexer for selection by label.
    DataFrame.dropna : Return DataFrame with labels on given axis omitted
        where (all or any) data are missing.
    DataFrame.drop_duplicates : Return DataFrame with duplicate rows
        removed, optionally only considering certain columns.
    Series.drop : Return Series with specified index labels removed.

    Examples
    --------
    >>> df = pd.DataFrame(np.arange(12).reshape(3, 4),
    ...                   columns=['A', 'B', 'C', 'D'])
    >>> df
       A  B   C   D
    0  0  1   2   3
    1  4  5   6   7
    2  8  9  10  11

    Drop columns

    >>> df.drop(['B', 'C'], axis=1)
       A   D
    0  0   3
    1  4   7
    2  8  11

    >>> df.drop(columns=['B', 'C'])
       A   D
    0  0   3
    1  4   7
    2  8  11

    Drop a row by index

    >>> df.drop([0, 1])
       A  B   C   D
    2  8  9  10  11

    Drop columns and/or rows of MultiIndex DataFrame

    >>> midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
    ...                              ['speed', 'weight', 'length']],
    ...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
    ...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
    >>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
    ...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
    ...                         [250, 150], [1.5, 0.8], [320, 250],
    ...                         [1, 0.8], [0.3, 0.2]])
    >>> df
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            weight  1.0     0.8
            length  0.3     0.2

    Drop a specific index combination from the MultiIndex
    DataFrame, i.e., drop the combination ``'falcon'`` and
    ``'weight'``, which deletes only the corresponding row

    >>> df.drop(index=('falcon', 'weight'))
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            length  0.3     0.2

    >>> df.drop(index='cow', columns='small')
                    big
    lama    speed   45.0
            weight  200.0
            length  1.5
    falcon  speed   320.0
            weight  1.0
            length  0.3

    >>> df.drop(index='length', level=1)
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
    falcon  speed   320.0   250.0
            weight  1.0     0.8

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Removing Rows</p>

<a id="6"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [108]:
df.drop('C', axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [109]:
df.drop(index = ["B"])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [110]:
df.drop(columns=['X'])

          W         Y         Z
A  2.706850  0.907969  0.503826
B  0.651118 -0.848077  0.605965
C -2.018168  0.528813 -0.589001
D  0.188695 -0.933237  0.955057
E  0.190794  2.605967  0.683509

In [111]:
df_temp = df.drop("C")
df_temp

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [112]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Selecting Rows and Columns using .loc[ ] and iloc[ ]</p>

<a id="7"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

#### `.loc[]` â†’ allows us to select data using **labels** (names) of rows (index) & columns

#### `.iloc[]` â†’ allows us to select data using **index numbers** of rows (index) & columns. it's like classical indexing logic

In [113]:
data = np.random.randint(1, 40, size=(8, 4))

df = pd.DataFrame(data, columns = ["var1", "var2", "var3", 'var4'])
df

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

In [114]:
df.loc[4]

var1    20
var2    36
var3    31
var4    11
Name: 4, dtype: int32

In [115]:
df.loc[2 : 5]

   var1  var2  var3  var4
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23

In [131]:
df.iloc[2 : 5]

   var1  var2  var3  var4
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11

In [116]:
"a b c d e f g h".split()

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

In [117]:
df.index = "a b c d e f g h".split()
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [134]:
df.iloc[1:4]

   var1  var2  var3  var4
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37

In [136]:
# df.loc[1 : 4]

In [118]:
df.loc['c' : 'g']

   var1  var2  var3  var4
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23

In [140]:
df.iloc[3, 2]

25

In [141]:
df.loc["d" : "g", "var2"]

d    30
e    36
f    28
g    24
Name: var2, dtype: int32

In [142]:
df.loc["d" : "g"]

   var1  var2  var3  var4
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23

In [143]:
df.loc["d" : "g"]["var2"]

d    30
e    36
f    28
g    24
Name: var2, dtype: int32

In [147]:
df.loc["d" : "g"][["var3"]]

   var3
d    25
e    31
f     9
g    38

In [148]:
df.loc["d" : "g", ["var3"]]

   var3
d    25
e    31
f     9
g    38

In [149]:
df.loc["d" : "g", ["var3", "var2"]]

   var3  var2
d    25    30
e    31    36
f     9    28
g    38    24

In [151]:
df.loc["d" : "g"][["var3", "var2"]]

   var3  var2
d    25    30
e    31    36
f     9    28
g    38    24

In [152]:
df.iloc[2:5, [2]]

   var3
c    12
d    25
e    31

In [155]:
# df.iloc[2:5][[2]]

In [156]:
df.iloc[2 : 5][["var3"]]

   var3
c    12
d    25
e    31

In [157]:
df.loc["a", "var1"]

8

In [158]:
df.loc[["a"], ["var1"]]

   var1
a     8

In [159]:
df.loc[["a", "c"], ["var1", "var3"]]

   var1  var3
a     8    39
c    13    12

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Conditional Selection</p>

<a id="8"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [160]:
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">One Conditional Statement</p>

<a id="8.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [161]:
df > 10

    var1   var2   var3   var4
a  False   True   True  False
b   True  False   True  False
c   True   True   True   True
d   True   True   True   True
e   True   True   True   True
f   True   True  False   True
g   True   True   True   True
h  False  False   True   True

In [163]:
df[df > 10]

   var1  var2  var3  var4
a   NaN  11.0  39.0   NaN
b  19.0   NaN  16.0   NaN
c  13.0  18.0  12.0  16.0
d  34.0  30.0  25.0  37.0
e  20.0  36.0  31.0  11.0
f  21.0  28.0   NaN  23.0
g  27.0  24.0  38.0  23.0
h   NaN   NaN  19.0  29.0

In [166]:
df.var2 < 10

a    False
b     True
c    False
d    False
e    False
f    False
g    False
h     True
Name: var2, dtype: bool

In [167]:
df[df.var2 < 10]

   var1  var2  var3  var4
b    19     8    16     1
h    10     3    19    29

In [169]:
df[df.var2 < 10][['var2']]

   var2
b     8
h     3

In [170]:
df[df.var2 > 10][['var2']]

   var2
a    11
c    18
d    30
e    36
f    28
g    24

In [171]:
df[df.var2 > 10][['var1']]

   var1
a     8
c    13
d    34
e    20
f    21
g    27

In [172]:
df[df.var2 > 10][['var1', "var2"]]

   var1  var2
a     8    11
c    13    18
d    34    30
e    20    36
f    21    28
g    27    24

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Two or More Conditional Statements</p>

<a id="8.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**For two or more conditions, you can use | â†’ or, & â†’ and with parenthesis:**

In [173]:
(df['var1'] > 10) & (df['var1'] < 20)

a    False
b     True
c     True
d    False
e    False
f    False
g    False
h    False
Name: var1, dtype: bool

In [174]:
df[(df['var1'] > 10) & (df['var1'] < 20)]

   var1  var2  var3  var4
b    19     8    16     1
c    13    18    12    16

In [175]:
df[(df['var1'] > 10) & (df['var1'] < 20)][["var4"]]

   var4
b     1
c    16

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Conditional Selection Using .loc[ ] and .iloc[ ]</p>

<a id="8.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [176]:
df.loc[["a"]]

   var1  var2  var3  var4
a     8    11    39    10

In [177]:
df.loc[["a", "f"]]

   var1  var2  var3  var4
a     8    11    39    10
f    21    28     9    23

In [178]:
df.loc[["a", "f"], ["var1", "var4"]]

   var1  var4
a     8    10
f    21    23

In [179]:
df.loc[(df["var1"] > 10), ["var2", "var3"]]

   var2  var3
b     8    16
c    18    12
d    30    25
e    36    31
f    28     9
g    24    38

In [181]:
df.loc[((df["var1"] < 10) | (df["var1"] > 30)), ["var2", "var3", "var1"]]

   var2  var3  var1
a    11    39     8
d    30    25    34

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">reset_index() & set_index()</p>

<a id="9"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [119]:
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [120]:
df.reset_index()

  index  var1  var2  var3  var4
0     a     8    11    39    10
1     b    19     8    16     1
2     c    13    18    12    16
3     d    34    30    25    37
4     e    20    36    31    11
5     f    21    28     9    23
6     g    27    24    38    23
7     h    10     3    19    29

In [121]:
df.reset_index(drop = True, inplace=True)

In [122]:
df

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

In [124]:
# df.index= df['var4'] # burada var4 index olarak atandi ama var4-column silinmedi

In [125]:
df.set_index("var4", inplace=True)

In [126]:
df

      var1  var2  var3
var4
10       8    11    39
1       19     8    16
16      13    18    12
37      34    30    25
11      20    36    31
23      21    28     9
23      27    24    38
29      10     3    19

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Multi-Index & Index Hierarchy</p>

<a id="10"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [ ]:
# Index Levels

outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2','M3', 'M3', 'M3']
inside = [1, 2, 3, 1, 2, 3, 5, 6, 7]
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1),
 ('M1', 2),
 ('M1', 3),
 ('M2', 1),
 ('M2', 2),
 ('M2', 3),
 ('M3', 5),
 ('M3', 6),
 ('M3', 7)]

**``Note``** that all of the MultiIndex constructors accept a names argument which stores string names for the levels themselves. If no names are provided, None will be assigned:

For more information Indexing and Selecting Data, visit [**Pandas Official Documentation**](https://pandas.pydata.org/pandas-docs/version/0.13.0/indexing.html)

Now let's show how to index this! For index hierarchy we use ``df.loc[]``, if this was on the columns axis, you would just use normal bracket notation ``df[]``. Calling one level of the index returns the sub-dataframe:

More information for Multiindex and Advanced Indexing, visit [**Pandas Official Documentation**](https://pandas.pydata.org/docs/user_guide/advanced.html)

<a id="12"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

________